tap 'argon/mas'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'sanemat/font'
brew 'python3'
brew 'libyaml'
brew 'openssl'
brew 'pkg-config'
brew 'ansifilter'
brew 'readline'
brew 'autoconf'
brew 'automake'
brew 'libpng'
brew 'gettext'
brew 'pcre'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'go'
brew 'docker'
brew 'findutils'
brew 'jpeg'
brew 'libtiff'
brew 'libtool'
brew 'webp'
brew 'ghq'
brew 'gnuplot'
brew 'graphviz'
brew 'hub'
brew 'openssl'
brew 'plenv'
brew 'pyenv'
brew 'rbenv'
brew 'jenv'
brew 'direnv'
brew 'oniguruma'
brew 'jq'
brew 'libevent'
brew 'nkf'
brew 'peco'
brew 'reattach-to-user-namespace'
brew 'ssh-copy-id'
brew 'swig'
brew 'source-highlight'
brew 'the_silver_searcher'
brew 'utf8proc'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'z'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'argon/mas/mas'
brew 'sanemat/font/ricty', args: ['--with-powerline']
brew 'tfenv'
brew 'ack'
brew 'node'
brew 'yarn'
brew 'zplug'
cask '1password'
# cask 'alfred'
cask 'caffeine'
cask 'dash'
cask 'dropbox'
cask 'karabiner-elements'
