tap 'homebrew/core'
tap 'homebrew/cask'

# tools
brew 'ansifilter'
brew 'coreutils'
brew 'curl'
brew 'docker-credential-helper-ecr'
brew 'findutils'
brew 'gettext'
brew 'ghq'
brew 'gpg'
brew 'hadolint'
brew 'hub'
brew 'jq'
brew 'maven'
brew 'peco'
brew 'readline'
brew 'ssh-copy-id'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'ack'
brew 'mas'
brew 'awscli'
brew 'grpcurl'
brew 'direnv'
brew 'postgresql@13'

tap 'weaveworks/tap'

# fonts
tap 'sanemat/font'
brew 'sanemat/font/ricty', args: ['with-powerline']
tap 'homebrew/cask-fonts'
cask 'font-myrica'

# Shell integrations
brew 'reattach-to-user-namespace'
brew 'source-highlight'
brew 'tmux'
brew 'z'
brew 'zplug'
brew 'zsh'

# Programming languages
brew 'clang-format'
brew 'plenv'
brew 'pyenv'
brew 'rbenv'
brew 'jenv'
brew 'direnv'
brew 'nodenv'
brew 'terraform-docs'
brew 'minamijoyo/tfupdate/tfupdate'
brew 'tfenv'
brew 'tflint'
brew 'goenv', args: ['HEAD']

# Cask Applications
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'homebrew/cask/emacs'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kindle'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'slack'
cask 'skitch'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'wireshark'
cask 'xmind'
cask 'drawio'
cask 'omnifocus'
cask 'spotify'
cask 'box-tools'
cask 'dbeaver-community'

# Application
cask '1password'

# AppStore Applications
mas "LINE", id: 539883307
mas "Pocket", id: 568494494
mas "Twitter", id: 1482454543
mas "Evernote", id: 406056744
mas "Amphetamine", id: 937984704
mas "XCode", id: 497799835
