tap 'argon/mas'
tap 'caskroom/cask'
tap 'homebrew/apache'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'sanemat/font'
cask 'java'
cask 'xquartz'
brew 'python3'
brew 'libyaml'
brew 'openssl'
brew 'pkg-config'
brew 'ansible'
brew 'ansifilter'
brew 'ant'
brew 'apr'
brew 'gdbm'
brew 'readline'
brew 'icu4c'
brew 'sqlite'
brew 'xz'
brew 'postgresql'
brew 'apr-util'
brew 'autoconf'
brew 'automake'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'emacs', args: ['with-cocoa']
brew 'cask'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'libsodium'
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl', 'with-brewed-svn', 'with-gettext', 'with-pcre']
brew 'go'
brew 'docker'
brew 'docker-machine'
brew 'findutils'
brew 'jpeg'
brew 'libtiff'
brew 'libtool'
brew 'gobject-introspection'
brew 'harfbuzz'
brew 'pango'
brew 'fontforge'
brew 'webp'
brew 'gd'
brew 'ghq'
brew 'lua'
brew 'gnuplot'
brew 'gradle'
brew 'graphviz'
brew 'hub'
brew 'openssl'
brew 'plenv'
brew 'pyenv'
brew 'rbenv'
brew 'jenv'
brew 'direnv'
brew 'oniguruma'
brew 'jq'
brew 'libevent'
brew 'markdown'
brew 'maven'
brew 'nkf'
brew 'peco'
brew 'reattach-to-user-namespace'
brew 'scons'
brew 'ssh-copy-id'
brew 'subversion', args: ['with-perl']
brew 'swig'
brew 'source-highlight'
brew 'the_silver_searcher'
brew 'tig'
brew 'utf8proc'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'z'
brew 'zsh'
brew 'elasticsearch'
brew 'kibana'
brew 'digdag'
brew 'zsh-syntax-highlighting'
brew 'argon/mas/mas'
brew 'sanemat/font/ricty'
cask '1password'
cask 'alfred'
cask 'aquaskk'
cask 'caffeine'
cask 'dash'
cask 'dropbox'
cask 'eclipse-jee'
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'growlnotify'
cask 'Caskroom/versions/intellij-idea-ce'
cask 'iterm2'
cask 'karabiner'
cask 'kindle'
cask 'onyx'
cask 'packer'
cask 'skype'
cask 'vagrant'
cask 'virtualbox'
cask 'wireshark'
mas 'The Unarchiver', id: 425424353
mas 'Growl', id: 467939042
mas 'iMovie', id: 408981434
mas 'iPhoto', id: 408981381
mas 'Twitter', id: 409789998
mas '1Password', id: 443987910
mas 'Keynote', id: 409183694
mas 'Pocket', id: 568494494
mas 'Display Menu', id: 549083868
mas 'OmniFocus', id: 402835630
mas 'SoraAnnai', id: 599799247
mas 'LINE', id: 539883307
mas 'Caffeine', id: 411246225
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Evernote', id: 406056744
mas 'PopClip', id: 445189367
