# tools
brew 'mise'
brew 'ansifilter'
brew 'coreutils'
brew 'curl'
brew 'difftastic'
brew 'findutils'
brew 'gettext'
brew 'gh'
brew 'ghq'
brew 'gpg'
brew 'hadolint'
brew 'hub'
brew 'jq'
brew 'maven'
brew 'peco'
brew 'readline'
brew 'ssh-copy-id'
brew 'tree'
brew 'watch'
brew 'ack'
brew 'mas'
brew 'awscli'
brew 'direnv'
brew 'postgresql@13'

# fonts
cask 'font-myrica'
cask 'font-fira-code-nerd-font'

# Shell integrations
brew 'reattach-to-user-namespace'
brew 'source-highlight'
brew 'tmux'
brew 'z'
brew 'zplug'
brew 'zsh'
brew 'starship'

# Programming languages
brew 'clang-format'
brew 'direnv'
brew 'uv'

# Cask Applications
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'homebrew/cask/emacs'
cask 'iterm2'
cask 'karabiner-elements'
cask 'google-chrome'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'wireshark'
cask 'xmind'
cask 'drawio'
cask '1password'

# AppStore Applications
mas "LINE", id: 539883307
mas "Evernote", id: 406056744
mas "Amphetamine", id: 937984704
mas "XCode", id: 497799835
