# ==============================================================================
# Brewfile - macOS パッケージ管理
# ==============================================================================

# ------------------------------------------------------------------------------
# シェル環境
# ------------------------------------------------------------------------------
brew 'zsh'                          # Z Shell - メインシェル
brew 'zplug'                        # zshプラグインマネージャー
brew 'starship'                     # クロスシェル対応のカスタマイズ可能なプロンプト
brew 'tmux'                         # ターミナルマルチプレクサ
brew 'reattach-to-user-namespace'   # tmuxでmacOSのクリップボード連携を有効化
brew 'source-highlight'             # lessコマンドでのソースコードシンタックスハイライト
brew 'z'                            # ディレクトリ間の高速移動（頻度・最近度ベース）
brew 'direnv'                       # ディレクトリごとの環境変数自動読み込み

# ------------------------------------------------------------------------------
# コアユーティリティ
# ------------------------------------------------------------------------------
brew 'coreutils'                    # GNU基本ユーティリティ（gls, gcat等）
brew 'findutils'                    # GNU検索ユーティリティ（gfind, gxargs等）
brew 'readline'                     # コマンドライン編集ライブラリ
brew 'gettext'                      # 国際化・地域化ライブラリ
brew 'curl'                         # URLデータ転送ツール
brew 'tree'                         # ディレクトリ構造をツリー表示
brew 'watch'                        # コマンドを定期実行して結果を監視
brew 'jq'                           # JSONプロセッサ（パース・フィルタリング）

# ------------------------------------------------------------------------------
# 検索・フィルタリング
# ------------------------------------------------------------------------------
brew 'ack'                          # 高速なソースコード検索ツール
brew 'peco'                         # インタラクティブフィルタリングツール

# ------------------------------------------------------------------------------
# Git・バージョン管理
# ------------------------------------------------------------------------------
brew 'gh'                           # GitHub公式CLI
brew 'hub'                          # GitHubワークフロー拡張CLI
brew 'ghq'                          # リモートリポジトリのローカル管理
brew 'difftastic'                   # 構文認識型の差分表示ツール

# ------------------------------------------------------------------------------
# 開発ツール・ランタイム管理
# ------------------------------------------------------------------------------
brew 'mise'                         # ポリグロットランタイムマネージャー（言語バージョン管理）
brew 'uv'                           # 高速Pythonパッケージマネージャー
brew 'clang-format'                 # C/C++/Objective-Cコードフォーマッタ
brew 'maven'                        # Javaプロジェクトビルドツール
brew 'hadolint'                     # Dockerfile静的解析ツール

# ------------------------------------------------------------------------------
# クラウド・インフラ
# ------------------------------------------------------------------------------
brew 'awscli'                       # AWS公式コマンドラインインターフェース

# ------------------------------------------------------------------------------
# セキュリティ・暗号化
# ------------------------------------------------------------------------------
brew 'gpg'                          # GNU Privacy Guard（暗号化・署名）
brew 'ssh-copy-id'                  # SSH公開鍵をリモートサーバーに登録

# ------------------------------------------------------------------------------
# その他ユーティリティ
# ------------------------------------------------------------------------------
brew 'ansifilter'                   # ANSIエスケープシーケンスの除去・変換
brew 'mas'                          # Mac App Store CLI

# ==============================================================================
# フォント
# ==============================================================================
cask 'font-myrica'                  # Myrica - プログラミング用日本語フォント
cask 'font-fira-code-nerd-font'     # Fira Code Nerd Font - リガチャ対応プログラミングフォント

# ==============================================================================
# GUIアプリケーション (Cask)
# ==============================================================================

# ------------------------------------------------------------------------------
# 開発ツール
# ------------------------------------------------------------------------------
cask 'docker'                       # Dockerコンテナ実行環境
cask 'homebrew/cask/emacs'          # Emacsテキストエディタ
cask 'ghostty'                      # GPU高速化ターミナルエミュレータ
cask 'visual-studio-code'           # VS Code - 汎用コードエディタ
cask 'wireshark'                    # ネットワークプロトコルアナライザ

# ------------------------------------------------------------------------------
# 生産性向上
# ------------------------------------------------------------------------------
cask 'alfred'                       # ランチャー・ワークフロー自動化ツール
cask 'karabiner-elements'           # キーボードカスタマイズツール
cask 'the-unarchiver'               # 各種アーカイブ形式の解凍ツール

# ------------------------------------------------------------------------------
# コミュニケーション・コラボレーション
# ------------------------------------------------------------------------------
cask 'slack'                        # チームコミュニケーションツール
cask 'dropbox'                      # クラウドストレージ・ファイル同期

# ------------------------------------------------------------------------------
# ブラウザ
# ------------------------------------------------------------------------------
cask 'google-chrome'                # Google Chromeウェブブラウザ

# ------------------------------------------------------------------------------
# ドキュメント・図表作成
# ------------------------------------------------------------------------------
cask 'drawio'                       # 図表・ダイアグラム作成ツール
cask 'xmind'                        # マインドマップ作成ツール
cask 'obsidian'                     # ノート・知識管理ツール（Markdown対応）

# ------------------------------------------------------------------------------
# セキュリティ
# ------------------------------------------------------------------------------
cask '1password'                    # パスワードマネージャー

# ==============================================================================
# Mac App Store アプリケーション
# ==============================================================================
mas 'LINE', id: 539883307           # LINEメッセンジャー
mas 'Evernote', id: 406056744       # ノート・情報整理アプリ
mas 'Amphetamine', id: 937984704    # スリープ防止ユーティリティ
mas 'XCode', id: 497799835          # Apple統合開発環境
